In [2]:
import calendar
c=calendar.month(1994,6)
c

'     June 1994\nMo Tu We Th Fr Sa Su\n       1  2  3  4  5\n 6  7  8  9 10 11 12\n13 14 15 16 17 18 19\n20 21 22 23 24 25 26\n27 28 29 30\n'

In [7]:
import calendar
c=calendar.calendar(1994)
print(c)

                                  1994

      January                   February                   March
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6          1  2  3  4  5  6
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       7  8  9 10 11 12 13
10 11 12 13 14 15 16      14 15 16 17 18 19 20      14 15 16 17 18 19 20
17 18 19 20 21 22 23      21 22 23 24 25 26 27      21 22 23 24 25 26 27
24 25 26 27 28 29 30      28                        28 29 30 31
31

       April                      May                       June
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3                         1             1  2  3  4  5
 4  5  6  7  8  9 10       2  3  4  5  6  7  8       6  7  8  9 10 11 12
11 12 13 14 15 16 17       9 10 11 12 13 14 15      13 14 15 16 17 18 19
18 19 20 21 22 23 24      16 17 18 19 20 21 22      20 21 22 23 24 25 26
25 26 27 28 29 30         23 24 25 26 27 28 29      27 28 29 30
                          30 31

        July                     August                  September
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3       1  2  3  4  5  6  7                1  2  3  4
 4  5  6  7  8  9 10       8  9 10 11 12 13 14       5  6  7  8  9 10 11
11 12 13 14 15 16 17      15 16 17 18 19 20 21      12 13 14 15 16 17 18
18 19 20 21 22 23 24      22 23 24 25 26 27 28      19 20 21 22 23 24 25
25 26 27 28 29 30 31      29 30 31                  26 27 28 29 30

      October                   November                  December
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6                1  2  3  4
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       5  6  7  8  9 10 11
10 11 12 13 14 15 16      14 15 16 17 18 19 20      12 13 14 15 16 17 18
17 18 19 20 21 22 23      21 22 23 24 25 26 27      19 20 21 22 23 24 25
24 25 26 27 28 29 30      28 29 30                  26 27 28 29 30 31
31

In [14]:
import datetime
c=datetime.datetime.now()
print(c)

2019-11-04 11:48:09.666854

In [ ]:
### NUMPY
#To add the elements which are in list and display the sum array 

import numpy as r
li=[1,2,3]
l2=[4,5,6]
rlist=r.array(li)
rlist2=r.array(l2)
print(rlist+rlist2)

 # Pandas

In [22]:
## SERIES

import pandas as pd
li=[1,2,3,4,5,6]
l2=pd.Series(li)
print(l2)
type(l2)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

pandas.core.series.Series

In [33]:
# In DICTIONARY FORMAT

import pandas as pd

dict={'S.No':[1,2,3,4],
      'Name':['Raghu','Prajna','Honey','Priya'],
      'Age':['27','25','28','29']
}
df=pd.DataFrame(dict)
df

   S.No    Name Age
0     1   Raghu  27
1     2  Prajna  25
2     3   Honey  28
3     4   Priya  29

In [39]:
#Location (in Series)

df.loc[0]

S.No        1
Name    Raghu
Age        27
Name: 0, dtype: object

In [40]:
#Location (in Dataframe)
df.loc[[0]]

   S.No   Name Age
0     1  Raghu  27

In [ ]:
## iloc gives the index and loc gives the location.

In [92]:
import pandas as pd

dict= {'S.No':[1,2,3,4,5,6,7,8],
      'Name':['Raghu','Prajna','Honey','Priya','Harish','Siri','Devi','Sweta'],
      'Age':['27','25','28','29','29','30','26','17'],
      'Marks':[10,20,30,40,25,17,28,35]
      }
df=pd.DataFrame(dict)
df

   S.No    Name Age  Marks
0     1   Raghu  27     10
1     2  Prajna  25     20
2     3   Honey  28     30
3     4   Priya  29     40
4     5  Harish  29     25
5     6    Siri  30     17
6     7    Devi  26     28
7     8   Sweta  17     35

In [59]:
df.loc[[3,5,7]]

   S.No   Name Age Marks
3     4  Priya  29    40
5     6   Siri  30    17
7     8  Sweta  17    35

In [71]:
df.loc[5:]

   S.No   Name Age Marks
5     6   Siri  30    17
6     7   Devi  26    28
7     8  Sweta  17    35

In [95]:
d=df.loc[df.Marks<=30]
d

   S.No    Name Age  Marks
0     1   Raghu  27     10
1     2  Prajna  25     20
2     3   Honey  28     30
4     5  Harish  29     25
5     6    Siri  30     17
6     7    Devi  26     28